RIET/src/Documents/ОперацияОСLawson/ОперацияОСLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияОСLawson</name>
  <registerRecords>InformationRegister.СостоянияОСLawson</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSS_FA</registerRecords>
  <attributes>
    <name>ОперацияLawson</name>
    <type>
      <types>DocumentRef.ОперацияLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>MovementType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <comment>Fmt nbr или disposal property</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>Asset</name>
      <type>
        <types>CatalogRef.ОсновныеСредстваLawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОС</name>
      <type>
        <types>DocumentRef.СписаниеОС</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.ВводНачальныхОстатковОС</types>
        <types>DocumentRef.МодернизацияОС</types>
        <types>DocumentRef.ПодготовкаКПередачеОС</types>
        <types>DocumentRef.РазукрупнениеОС</types>
        <types>DocumentRef.ПеремещениеОС</types>
      </type>
    </attributes>
    <attributes>
      <name>PoNbr</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MngmOnly</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AssetCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Serial</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SerialNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AssetType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InsrvDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Life</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GltObjID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourceDocument</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Company</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>XferCompany</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementGbv</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DepreciationLtd</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyCd</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Deferred</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>AsdDspProperty</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FmtNbr</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SubGeomarket</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/СостоянияОСLawson/СостоянияОСLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОСLawson</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОСLawson</types>
    </type>
  </resources>
  <dimensions>
    <name>ОСLawson</name>
    <type>
      <types>CatalogRef.ОсновныеСредстваLawson</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/СостояниеОСLawson/СостояниеОСLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОСLawson</name>
  <enumValues>
    <name>Active</name>
  </enumValues>
  <enumValues>
    <name>Disposed</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ОперацияОСLawson/ObjectModule.bsl
Перем мУдалятьДвижения;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	
	Если СокрЛП(MovementType) = "DISPOSAL" ИЛИ СокрЛП(MovementType) = "TRANSFER OSS" Тогда
		СостояниеОСLawson = Перечисления.СостояниеОСLawson.Disposed;
	Иначе	
		СостояниеОСLawson = Перечисления.СостояниеОСLawson.Active;
	КонецЕсли; 
	
	//Проверим состояние на дату документа, и записи в регистр 
	//будем вносить только, если состояние изменилось
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацияОСLawsonОС.Asset
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ОперацияОСLawson.ОС КАК ОперацияОСLawsonОС
	|ГДЕ
	|	ОперацияОСLawsonОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Asset
	|ПОМЕСТИТЬ Assets
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Assets.Asset,
	|	СостоянияОСLawsonСрезПоследних.Состояние
	|ИЗ
	|	Assets КАК Assets
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСLawson.СрезПоследних(
	|				&Дата,
	|				ОСLawson В
	|					(ВЫБРАТЬ
	|						ВТ.Asset
	|					ИЗ
	|						ВТ КАК ВТ)) КАК СостоянияОСLawsonСрезПоследних
	|		ПО Assets.Asset = СостоянияОСLawsonСрезПоследних.ОСLawson
	|ГДЕ
	|	(СостоянияОСLawsonСрезПоследних.Состояние ЕСТЬ NULL 
	|			ИЛИ (НЕ СостоянияОСLawsonСрезПоследних.Состояние = &Состояние))";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("Состояние", СостояниеОСLawson);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.СостоянияОСLawson.Добавить();
		Движение.Период = Дата;
		Движение.ОСLawson = ВыборкаДетальныеЗаписи.Asset;
		Движение.Состояние = СостояниеОСLawson;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если MovementType = "ADDITION" ИЛИ  MovementType = "TRANSFER OSS" Тогда
		Для Каждого СтрокаТЧ Из ОС Цикл
			Если СтрокаТЧ.Asset.Deferred <> СтрокаТЧ.Deferred Тогда
				Эл = СтрокаТЧ.Asset.ПолучитьОбъект();
				Эл.Deferred = СтрокаТЧ.Deferred;
				Эл.Записать();
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
